In [1]:
import pandas as pd

In [3]:
df = pd.read_json("user_data.json")
df.head(2)

,user_id,creation_date,name,street,state,city,country,birthdate,gender,device_address,user_type
0,USER40678,2021-03-17 22:56:13,Zion Feest,14938 West Trace side,New Jersey,Birmingham,Hong Kong,1998-04-06 05:29:37,male,17:fb:f2:60:94:4b,basic
1,USER08728,2022-10-10 12:53:20,Kattie Bergstrom,4476 West Haven fort,Alabama,Irvine,Mayotte,2003-05-22 11:16:19,male,b0:17:a7:0b:d6:67,premium

In [4]:
df = pd.read_pickle("user_credit_card.pickle")
df.head(2)

     user_id              name  credit_card_number issuing_bank
0  USER40678        Zion Feest          4294956114          bpi
1  USER08728  Kattie Bergstrom          2742902159          bdo